app/Services/ClienteService.php

    public function getClientes()
    {
        /*
            Retorna a lista de clientes.
        */

        try {

            $clientes = $this->clienteModel->paginate(5);
---
SELECT *
FROM `clientes`
 LIMIT 5, 5
SELECT COUNT(*) AS `numrows`
FROM `clientes`