app/Services/EstadoService.php

    public function getAllEstados() {
        try {

            $estados = $this->estadoModel->select('id, nome')->orderBy('nome')->findAll();
---
SELECT `id`, `nome`
FROM `estados`
ORDER BY `nome`