app/Services/MunicipioService.php

SELECT `id`, `nome`
FROM `municipios`
WHERE `estado_id` = '22'
---
    public function getMunicipiosByEstado($estadoId)
    {
        try {

            $municipios = $this->municipioModel->select('id, nome')->where('estado_id', $estadoId)->findAll();